cask_args appdir: "/Applications"

# Development tools
brew 'git'
brew 'gh'
brew 'go'
brew 'terraform'
brew 'cmake'

# CLI utilities
brew 'fd'
brew 'ripgrep'
brew 'fzf'
brew 'jq'
brew 'yq'
brew 'tree-sitter'
brew 'difftastic'
brew 'gum'

# Media/imaging
brew 'ffmpeg'
brew 'imagemagick'
brew 'exiftool'

# System tools
brew 'nmap'
brew 'scrcpy'
brew 'smartmontools'
brew 'cloudflared'
brew 'bitwarden-cli'

# Modern replacements
brew 'neovim'

# Language version managers
brew 'uv'  # Python

# Shell
brew 'bash'
brew 'zsh'

# GUI Applications (casks)
cask 'flashspace'
cask 'linearmouse'
cask 'whatsapp'
cask 'raycast'
cask 'vlc'
cask 'android-platform-tools'
cask 'ghostty'
