cask_args appdir: "/Applications"

tap 'homebrew/bundle'

brew 'cloudflared'
brew 'imagemagick'
brew 'redis'
brew 'wg'
brew 'wireguard-tools'
brew 'bitwarden-cli'
brew 'cmake'
brew 'gh'
brew 'git-filter-repo'
brew 'nmap'
brew 'uv'
brew 'go'

cask 'aerospace'
cask 'flashspace'
cask 'linearmouse'
cask 'whatsapp'
cask 'raycast'
cask 'vlc'
cask 'android-platform-tools'
